In [1]:
import numpy as np
import pandas as pd

In [4]:
data= pd.Series([1,np.nan,3.5,np.nan,10])
print(data)

0     1.0
1     NaN
2     3.5
3     NaN
4    10.0
dtype: float64

In [5]:
data.isnull()        #check NULL or not

0    False
1     True
2    False
3     True
4    False
dtype: bool

In [6]:
data[0]=None
data.isnull()

0     True
1     True
2    False
3     True
4    False
dtype: bool

In [8]:
data.fillna(0.0)    #filling null values

0     0.0
1     0.0
2     3.5
3     0.0
4    10.0
dtype: float64

In [16]:
# data={0:[1,2,3,4,np.nan],
#     1:[2,3,np.nan,5,np.nan]}

df=pd.DataFrame({0:[1,2,4,np.nan,5],
                1:[2,3,np.nan,np.nan,9]})
df1=df
df1

     0    1
0  1.0  2.0
1  2.0  3.0
2  4.0  NaN
3  NaN  NaN
4  5.0  9.0

In [17]:
df.dropna()

     0    1
0  1.0  2.0
1  2.0  3.0
4  5.0  9.0

In [21]:
df.dropna(how='all',axis=0)

     0    1
0  1.0  2.0
1  2.0  3.0
2  4.0  NaN
4  5.0  9.0

In [24]:
df2=pd.DataFrame(np.random.randn(7,3))
df2.iloc[:3,0]=np.nan
df2.iloc[:4,1]=np.nan
df2.iloc[:2,2]=np.nan
df2

          0         1         2
0       NaN       NaN       NaN
1       NaN       NaN       NaN
2       NaN       NaN  0.932048
3 -0.213147       NaN  0.322974
4 -1.274856 -0.231565  1.662441
5  0.373835 -1.645563 -1.486820
6 -1.540252  1.502579  1.945296

In [26]:
df2.dropna(thresh=2)  # 2 NaN in single row it will drop

          0         1         2
3 -0.213147       NaN  0.322974
4 -1.274856 -0.231565  1.662441
5  0.373835 -1.645563 -1.486820
6 -1.540252  1.502579  1.945296

In [27]:
df2.fillna(0)

          0         1         2
0  0.000000  0.000000  0.000000
1  0.000000  0.000000  0.000000
2  0.000000  0.000000  0.932048
3 -0.213147  0.000000  0.322974
4 -1.274856 -0.231565  1.662441
5  0.373835 -1.645563 -1.486820
6 -1.540252  1.502579  1.945296

In [29]:
df2.fillna(method='bfill')       # filling NaN value from below cell after Nan in col

          0         1         2
0 -0.213147 -0.231565  0.932048
1 -0.213147 -0.231565  0.932048
2 -0.213147 -0.231565  0.932048
3 -0.213147 -0.231565  0.322974
4 -1.274856 -0.231565  1.662441
5  0.373835 -1.645563 -1.486820
6 -1.540252  1.502579  1.945296

In [34]:
df4=pd.DataFrame(np.random.randn(5,5))
df4.iloc[1:3,0]=np.nan
df4.iloc[3:4,1]=np.nan
df4.iloc[2:4,4]=np.nan
df4

          0         1         2         3         4
0  2.217993 -0.802293  1.010871 -0.507459 -0.485177
1       NaN  1.096866 -0.801984  2.095147  1.248464
2       NaN -0.329497  0.198201 -0.166064       NaN
3 -0.520781       NaN -0.487673 -0.161231       NaN
4 -0.295157  0.668446 -0.740312  0.883520  0.694885

In [41]:
df4.fillna(method="ffill")     # forward_filling NaN value from forward cell before Nan in col
df4

          0         1         2         3         4
0  2.217993 -0.802293  1.010871 -0.507459 -0.485177
1  2.217993  1.096866 -0.801984  2.095147  1.248464
2  2.217993 -0.329497  0.198201 -0.166064  1.248464
3 -0.520781 -0.329497 -0.487673 -0.161231  1.248464
4 -0.295157  0.668446 -0.740312  0.883520  0.694885

# Data Transformation